{
    "module_visualization": {
        "title": "Visualización por módulo",
        "first": [{
                "subtitle": "Propósito del reporte",
                "content": [
                    "Refleja la completación de los módulos en base al acceso de los recursos."
                ]
            },
            {
                "subtitle": "Criterio",
                "content": [
                    "La completación del módulo se construye mediante los y las estudiantes que ingresaron al menos una vez a todos sus recursos, siendo indiferente la cantidad total de visitas por cada material."
                ]
            },
            {
                "subtitle": "Obtención de datos",
                "content": [
                    "Se obtiene la cantidad de recursos del módulo y aquellos que el o la estudiante visitó.",
                    "Se calcula un porcentaje de completación del módulo en base a los valores anteriores (total de recursos y recursos vistos); si el porcentaje es 100%, entonces tenemos el módulo completo.",
                    "Se calcula un promedio de completación para el módulo basado en el total de los o las estudiantes de la sección. Aquellos/as que finalizaron el módulo, dan como resultado el progreso de completación de cada módulo."
                ]
            }
        ]
    },
    "resource_type_usage": {
        "title": "Visualizacion por tipo de recurso",
        "first": [{
                "subtitle": "Propósito del reporte",
                "content": [
                    "Muestra la distribución de los diferentes tipos de recursos utilizados en el curso.",
                    "Refleja las visualizaciones por parte de los y las estudiantes para cada tipo de recursos."
                ]
            },
            {
                "subtitle": "Criterio",
                "content": [
                    "La distribución de recursos se construye mediante los recursos disponibles y la agrupación de estos recursos por su tipo.",
                    "Las visualizaciones del tipo de recurso se construyen mediante la agrupación de recursos del mismo tipo. Posteriormente se asignan las visitas de los y las estudiantes a cada uno, siendo indiferente la cantidad total de visitas por cada usuario/a."
                ]
            },
            {
                "subtitle": "Obtención de datos",
                "content": [
                    "Se obtiene el total de recursos del curso y se agrupan según su tipo.",
                    "Se calcula un porcentaje para cada grupo de recursos según su cantidad dentro del grupo y el total de recursos disponibles."
                ]
            }
        ]
    },
    "file_type_usage": {
        "title": "Visualizacion por tipo de archivo",
        "first": [{
                "subtitle": "Propósito del reporte",
                "content": [
                    "Muestra la diversidad de tipos de archivos subidos al curso.",
                    "Refleja las visualizaciones por parte de los y las estudiantes para cada tipo de archivo."
                ]
            },
            {
                "subtitle": "Criterio",
                "content": [
                    "Se obtienen todos los archivos que se encuentren agregados como ítem de módulo, posteriormente se agrupan según su MIME TYPE (tipo de archivo), para clasificarlo en diferentes categorías.",
                    "Las visualizaciones del tipo de archivo se construyen mediante la agrupación de los materiales en sus diferentes categorías. Posteriormente se asignan las visitas de los y las estudiantes a cada archivo, siendo indiferente la cantidad total de visitas por cada usuario/a."
                ]
            },
            {
                "subtitle": "Obtención de datos",
                "content": [
                    "Diversidad en el tipo de archivo: Se obtienen todos los archivos que se encuentren como ítem de módulo y se agrupan según su categoría, (MIME TYPE). Se calcula un porcentaje para cada categoría de archivos según su cantidad dentro de la clase y el total de materiales disponibles en los ítems de módulo.",
                    "Visualización del tipo de archivo: Se obtienen todos los archivos que se encuentren como ítem de módulo y se agrupan según su categoría (MIME TYPE). Luego se asignan los y las estudiantes que visualizaron cada archivo. Se calcula un porcentaje de visualización por cada estudiante según los archivos de la categoría que visualizó. Finalmente se entrega el promedio de los porcentajes de visualización obtenidos y se entrega por cada categoría de archivos."

                ]
            }
        ]
    },
    "interaction_by_resource": {
        "title": "Interacción por recurso",
        "first": [{
                "subtitle": "Propósito del reporte",
                "content": [
                    "Muestra los recursos con los que los/as estudiantes no estén interactuando."
                ]
            },
            {
                "subtitle": "Criterio",
                "content": [
                    "Por cada recurso se obtienen los y las estudiantes que vieron al menos una vez el recurso y aquellos/as que nunca ingresaron."
                ]
            },
            {
                "subtitle": "Obtención de datos",
                "content": [
                    "Se obtiene el listado de recursos del curso y se le asignan las visualizaciones de cada estudiante.",
                    "Se cuenta la cantidad de estudiantes que vieron al menos una vez el recurso y los que no lo vieron."
                ]
            }
        ]
    },
    "resource_visualization": {
        "title": "visualización de recursos",
        "first": [{
                "subtitle": "Propósito del reporte",
                "content": [
                    "Identifica qué recursos son los más visualizados por el/la estudiante."
                ]
            },
            {
                "subtitle": "Criterio",
                "content": [
                    "Cuenta todas las visitas que pueden producirse sobre un recurso."
                ]
            },
            {
                "subtitle": "Obtención de datos",
                "content": [
                    "Se obtienen los recursos del curso.",
                    "Se cuenta el total de visitas por estudiante para cada recurso.",
                    "Se suman las visitas de los y las estudiantes."
                ]
            }
        ]
    },
    "course_communication": {
        "title": "Comunicación del curso",
        "first": [{
                "subtitle": "Propósito del reporte",
                "content": [
                    "Transparenta la distribución de la comunicación en los diferentes canales que tienen los y las estudiantes dentro del curso. "
                ]
            },
            {
                "subtitle": "Criterio",
                "content": [
                    "Se identifican los canales de comunicación que puede haber disponibles dentro del curso (foros, mail de Canvas). Luego se contabilizan las entradas o comentarios en todos los foros no evaluados creados en el curso. Si el foro es evaluado, puede condicionar la cantidad de comentarios de los y las estudiantes, y los mensajes enviados por la herramienta de mail de Canvas, sin importar su destinatario.",
                    "En base al total del contenido generado, se calcula el porcentaje de uso de cada herramienta."
                ]
            },
            {
                "subtitle": "Obtención de datos",
                "content": [
                    "Se cuentan las entradas en foros no evaluados.",
                    "Se cuentan los mensajes del mail enviados por estudiantes.",
                    "Se suman todas las entradas, mensajes y se calcula el respectivo porcentaje de uso de cada herramienta."
                ]
            }
        ]
    },
    "evaluation_panic": {
        "title": "Análisis de evaluación",
        "first": [{
                "subtitle": "Propósito del reporte",
                "content": [
                    "Identifica los recursos vistos previos a la fecha de inicio de una evaluación y los recursos vistos de manera posterior a la fecha de cierre de la evaluación. "
                ]
            },
            {
                "subtitle": "Criterio",
                "content": [
                    "Se obtienen los recursos que cuentan con visualizaciones los días relacionados a la evaluación."
                ]
            },
            {
                "subtitle": "Obtención de datos",
                "content": [
                    "Se obtienen las visualizaciones de los y las estudiantes para los días relacionados a la evaluación (antes y después). Luego se suman las visualizaciones por estudiante para cada recurso.",
                    "Se calcula el porcentaje de alumnos/as que vieron el recurso al menos una vez (sin importar el total de visualizaciones). "
                ]
            }
        ]
    },
    "course_interaction": {
        "title": "Interacciones del curso",
        "first": [{
                "subtitle": "Propósito del reporte",
                "content": [
                    "Muestra en qué jornadas horarias y días, los y las estudiantes interactuaron más con el curso. "
                ]
            },
            {
                "subtitle": "Criterio",
                "content": [
                    "Agrupa las interacciones por día de la semana y jornada horaria de todos los y las estudiantes, de forma mensual; y entrega un total de interacciones ordenadas temporalmente."
                ]
            },
            {
                "subtitle": "Obtención de datos",
                "content": [
                    "Agrupa las interacciones de los y las estudiantes por año, mes, día de la semana y jornada horaria.",
                    "Se suman las interacciones provenientes de la agrupación previa para cada jornada horaria.  "
                ]
            }
        ]
    }
}